src/DataProcessors/ОчисткаЖурналаВыполненияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОчисткаЖурналаВыполненияРегламентныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГлубинаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИсторияВыполненияРегламентныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВыполненияРегламентныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыФормированияСлужебныхЗаданий</v8:Type>
						<v8:Type>cfg:CatalogRef.ПараметрыФормированияЗаказовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеЗадание</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыВыполненияРеглЗаданияАвтоФормированияДок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ОчисткаЖурналаВыполненияРегламентныхЗаданий/Ext/ObjectModule.bsl
Процедура ОчиститьЖурнал() Экспорт
	
	НаборЗаписи  = РегистрыСведений.ИсторияВыполненияРегламентныхЗаданий.СоздатьНаборЗаписей();
	
	Если ГлубинаДней = 0 тогда
		НаборЗаписи.Записать();
	Иначе
		ГлубинаИстории = НачалоДня(ТекущаяДата() - 60*60*24*ГлубинаДней);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияВыполненияРегламентныхЗаданий.МоментВремени,
		|	ИсторияВыполненияРегламентныхЗаданий.Задание,
		|	ИсторияВыполненияРегламентныхЗаданий.Этап
		|ИЗ
		|	РегистрСведений.ИсторияВыполненияРегламентныхЗаданий КАК ИсторияВыполненияРегламентныхЗаданий
		|ГДЕ
		|	ИсторияВыполненияРегламентныхЗаданий.МоментВремени < &МоментВремени";

		Запрос.УстановитьПараметр("МоментВремени", ГлубинаИстории);
		Результат = Запрос.Выполнить().Выгрузить();

		Если Результат.Количество() = 0 тогда
			Возврат;
		КонецЕсли;
		
		Для каждого стрИ из Результат цикл
							
			НаборЗаписи.Отбор.МоментВремени.Установить(стрИ.МоментВремени);
			НаборЗаписи.Отбор.Задание.Установить(стрИ.Задание);
			НаборЗаписи.Отбор.Этап.Установить(стрИ.Этап);
			
			НаборЗаписи.Очистить();
			НаборЗаписи.Записать();
							
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Если Сервер тогда
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	ОчиститьЖурнал();
КонецПроцедуры
#КонецЕсли
